<details><summary>Show Plan</summary>

```

terraform
data.assert_test.workspace: Reading...
data.assert_test.workspace: Read complete after 0s
module.o11y.grafana_data_source.cloudwatch: Refreshing state... [id=44]
module.ecs.data.aws_vpc.vpc: Reading...
module.dns.data.aws_route53_zone.hosted_zone: Reading...
module.dns.aws_acm_certificate.domain_certificate: Refreshing state... [id=arn:aws:acm:eu-central-1:898587786287:certificate/f3565b91-c093-4dfd-9916-76f16cc6cbe8]
aws_prometheus_workspace.prometheus: Refreshing state... [id=ws-e8c738d4-a43b-41aa-83ac-ac6d8a3e5f65]
data.aws_ecr_repository.repository: Reading...
module.ecs.aws_cloudwatch_log_group.cluster_logs: Refreshing state... [id=staging_rpc-proxy_logs]
module.ecs.data.aws_iam_policy_document.assume_role_policy: Reading...
module.ecs.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
module.ecs.aws_iam_role.ecs_task_execution_role: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role]
module.o11y.grafana_data_source.prometheus: Refreshing state... [id=45]
module.ecs.aws_iam_role_policy_attachment.prometheus_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220908201556715000000001]
module.ecs.aws_iam_role_policy_attachment.ecs_task_execution_role_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526273800000003]
module.ecs.aws_iam_role_policy_attachment.cloudwatch_write_policy: Refreshing state... [id=staging_rpc-proxy_ecs_task_execution_role-20220819184526269000000002]
data.aws_ecr_repository.repository: Read complete after 0s [id=rpc-proxy]
module.ecs.aws_ecs_task_definition.app_task: Refreshing state... [id=staging_rpc-proxy]
module.ecs.aws_ecs_cluster.app_cluster: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:cluster/staging_rpc-proxy_cluster]
module.dns.data.aws_route53_zone.hosted_zone: Read complete after 0s [id=Z09669243E0Q6ZCWCIW2U]
module.dns.aws_route53_record.cert_verification[0]: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U__4298f596ebd4d4df199cb24cba8db7f8.staging.rpc.walletconnect.com._CNAME]
module.o11y.grafana_dashboard.at_a_glance: Refreshing state... [id=staging_rpc-proxy]
module.ecs.data.aws_vpc.vpc: Read complete after 1s [id=vpc-09dce0b23af575478]
module.ecs.aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-rpc-proxy-ded/8d9823f8adeda723]
module.ecs.data.aws_subnets.public_subnets: Reading...
module.ecs.data.aws_subnets.private_subnets: Reading...
module.ecs.aws_security_group.tls_ingess: Refreshing state... [id=sg-0f3c213ea19bfc4d7]
module.ecs.aws_security_group.vpc_app_ingress: Refreshing state... [id=sg-0fdb388e2b1c042d3]
module.ecs.data.aws_subnets.public_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.data.aws_subnets.private_subnets: Read complete after 1s [id=eu-central-1]
module.ecs.aws_alb.network_load_balancer: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:loadbalancer/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6]
module.ecs.aws_ecs_service.app_service: Refreshing state... [id=arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service]
module.ecs.aws_route53_record.dns_load_balancer: Refreshing state... [id=Z09669243E0Q6ZCWCIW2U_staging.rpc.walletconnect.com_A]
module.ecs.aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:898587786287:listener/net/staging-rpc-proxy-lb-8bf/9db7ff60731600a6/62a7b956c11689e5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_rpc-proxy_cluster/staging_rpc-proxy-service"
        name                               = "staging_rpc-proxy-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:19" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_rpc-proxy:18" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ environment      = [
                        {
                            name  = "INFURA_PROJECT_ID"
                            value = "9861a40ac15f47758d54f66a14a8f8b2"
                        },
                      + {
                          + name  = "POKT_PROJECT_ID"
                          + value = "62ff3f53852035003a873d84"
                        },
                    ]
                  - mountPoints      = [] -> null
                    name             = "staging_rpc-proxy"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                    name             = "aws-otel-collector"
                  - portMappings     = [] -> null
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "staging_rpc-proxy" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

      ~ runtime_platform {
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Argument is deprecated

  with module.o11y.grafana_data_source.prometheus,
  on monitoring/main.tf line 21, in resource "grafana_data_source" "prometheus":
  21: resource "grafana_data_source" "prometheus" {

Use json_data_encoded instead. It supports arbitrary JSON data, and therefore
all attributes.

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /tmp/plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/tmp/plan.tfplan"

```

</details>

*Action: `pull_request`*